In [7]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']
lst = [10,20,30]
pd.Series(index=labels, data=lst)

a    10
b    20
c    30
dtype: int64

In [4]:
d = {'one': 1, 'two': 2, 'three': 3}
pd.Series(d)

one      1
two      2
three    3
dtype: int64

In [6]:
s1 = pd.Series({'USA': 1.3, 'India': 2.4, 'China': 1.4})
s2 = pd.Series({'USA': 0.3, 'Germany': 5.5, 'China': 1.6})
s3 = s1 + s2
print(s3)

China      3.0
Germany    NaN
India      NaN
USA        1.6
dtype: float64

In [12]:
df = pd.DataFrame(np.random.randn(5,3), index='A B C D E'.split(), columns='X Y Z'.split())

In [17]:
print(type(df))
print(type(df.loc['A']))
print(type(df.at['A', 'X']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'numpy.float64'>

In [16]:
df.loc['A']

X    1.416315
Y    0.890676
Z    1.161963
Name: A, dtype: float64

In [18]:
df[['X','Y']]

          X         Y
A  1.416315  0.890676
B -0.179812 -0.385905
C  0.524753 -0.574199
D  1.456015 -0.914665
E  0.961420  1.551698

In [19]:
df['new'] = df['Y'] + df['Z']
df

          X         Y         Z       new
A  1.416315  0.890676  1.161963  2.052640
B -0.179812 -0.385905 -0.464923 -0.850828
C  0.524753 -0.574199 -0.027268 -0.601467
D  1.456015 -0.914665  1.125994  0.211329
E  0.961420  1.551698 -2.138945 -0.587247

In [23]:
df[0 < df['X']]

          X         Y         Z       new
A  1.416315  0.890676  1.161963  2.052640
C  0.524753 -0.574199 -0.027268 -0.601467
D  1.456015 -0.914665  1.125994  0.211329
E  0.961420  1.551698 -2.138945 -0.587247